web-service-tutorial/target/classes/HelloWorld.wsdl

<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://davenkin.thoughtworks.com/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://davenkin.thoughtworks.com/" name="HelloWorldImplService">
    <types/>
    <message name="getHelloWorldAsString">
        <part name="arg0" type="xsd:string"/>
    </message>
    <message name="getHelloWorldAsStringResponse">
        <part name="return" type="xsd:string"/>
    </message>
    <portType name="HelloWorld">
        <operation name="getHelloWorldAsString">
            <input message="tns:getHelloWorldAsString"/>
            <output message="tns:getHelloWorldAsStringResponse"/>
        </operation>
    </portType>
    <binding name="HelloWorldImplPortBinding" type="tns:HelloWorld">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <operation name="getHelloWorldAsString">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://davenkin.thoughtworks.com/"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://davenkin.thoughtworks.com/"/>
            </output>
        </operation>
    </binding>
    <service name="HelloWorldImplService">
        <port name="HelloWorldImplPort" binding="tns:HelloWorldImplPortBinding">
            <soap:address location="http://localhost:9999/ws/hello"/>
        </port>
    </service>
</definitions>